geniverse/app/controllers/activities_controller.rb

  def index
    @activities = Activity.all
---
SELECT * FROM "activities"

  def show
    @activity = Activity.find(params[:id])
---
SELECT * FROM "activities" WHERE ("activities"."id" = 1)

  def create
    @activity = Activity.new(params[:activity])

    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("base_channel_name", "created_at", "updated_at", "max_users_in_room", "initial_alleles", "send_bred_dragons") VALUES('qqwewe', '2010-07-06 15:05:00', '2010-07-06 15:05:00', 0, 'qweqeqe', 'f')

  def destroy
    @activity = Activity.find(params[:id])
    @activity.destroy
---
SELECT * FROM "activities" WHERE ("activities"."id" = 1)
DELETE FROM "activities" WHERE "id" = 1